Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: To install it, press &shortcut:ShowIntentionActions; and choose the corresponding quick-fix.
zh_cn: 要安装它，请按 &shortcut:ShowIntentionActions; 并选择相应的快速修复。

source: To make sure you didn't miss some slash of quotation mark, place the caret somewhere in the expression you want to check, and press &shortcut:ShowIntentionActions;.
zh_cn: 为了确保你不会遗漏引号中的斜线，将插入符号放到想检查表达式处，然后按 &shortcut:ShowIntentionActions;。

source: To make sure you didn't miss some slash or quotation mark, place the caret somewhere in the expression you want to check, and press &shortcut:ShowIntentionActions;.
zh_cn: 为了确保你不会遗漏引号中的斜线，将插入符号放到想检查表达式处，然后按 &shortcut:ShowIntentionActions;。

source: To narrow the list down, start typing the name of the item you're looking for.
zh_cn: 要缩小列表的范围，请输入您要查找的项目的名称。

source: To navigate to a file by its name, press &shortcut:GotoFile; (Navigate | File) and start typing the name.
zh_cn: 要通过名称导航到文件，请按 &shortcut:GotoFile;(Navigate | File)并开始输入名称。

source: To navigate to a folder by its name, use the same steps as for navigating to a file: press &shortcut:GotoFile; (Navigate | File), start typing the folder name, and add a slash at the end.
zh_cn: 要按照名称导航到文件夹，请使用与导航到文件相同的步骤：按 &shortcut:GotoFile;(Navigate | File)，开始输入文件夹名称，并在末尾添加斜杠。

source: To navigate to a type by its name, press &shortcut:GotoClass; (Navigate | Class) and start typing the name.
zh_cn: 要按名称导航到某个类，请按 &shortcut:GotoClass;(Navigate | Class)并开始输入名称。

source: To navigate to a type, function, field, or constant by its name, press &shortcut:GotoSymbol; (Navigate | Symbol) and start typing the name.
zh_cn: 要按名称导航到类型，函数，字段或常量，请按 &shortcut:GotoSymbol;(Navigate | Symbol)并开始输入名称。

source: To navigate to the declaration of a class, method or variable used somewhere in the code, position the caret at the usage and press &shortcut:GotoDeclaration; (Navigate | Declaration).
zh_cn: 要从类，方法或字段在代码中的使用处导航到定义处，请将插入符号定位到使用处，然后按 &shortcut:GotoDeclaration; (Navigate | Declaration)。

source: To navigate to the declaration of a class, method or variable used somewhere in the code, position the caret at the usage and press &shortcut:GotoDeclaration;.
zh_cn: 要从类，方法或字段在代码中的使用处导航到定义处，请将插入符号定位到使用处，然后按 &shortcut:GotoDeclaration; 。

source: To navigate to the declaration of a type, function, field, variable, or any other symbol, press &shortcut:GotoDeclaration; (Navigate | Declaration) when the caret is at the symbol, or simply left-click the symbol while holding Meta.
zh_cn: 要导航到类，函数，字段，变量或任何其他符号的声明，请在插入符号在符号处时按 &shortcut:GotoDeclaration;(Navigate | Declaration)，或者只需在按住 Meta 的同时左键单击该符号。

source: To navigate to the implementation(s) of an abstract method, position the caret at its usage or its name in the declaration and press &shortcut:GotoImplementation;.
zh_cn: 要导航到抽象方法的实现，将插入符号定位它的使用处或申明的名字处，然后按 &shortcut:GotoImplementation;。

source: To nearest indent position
zh_cn: 最近缩进位置

source: To open a project in the same window with the already opened one, choose Open directory, then in the Open project dialog box, select the option Open in current window, and select the check box Add to currently opened projects.
zh_cn: 要在已打开的窗口中打开项目，请选择 Open directory，然后在 Open project 对话框中选择选项 Open in current window，然后选中复选框 Add to currently opened projects。

source: To open a project in the same window with the already opened one, choose Open on the File menu, then in the Open project dialog box, select the option Open in current window, and select the check box Add to currently opened projects.
zh_cn: 要在已打开一个项目的窗口中再打开一个项目，在 File 菜单中选择 Open ，然后在 Open project 对话框中，选择按钮 Open in current window ，然后选中复选框 Add to currently opened projects 。

source: To open again one of the recent projects, use Reopen(on Windows and Linux)/Open Recent(on MacOS) on the File menu:
zh_cn: 要重新打开一个最近项目，在 File 菜单使用 Reopen(Windows 或 Linux)/Open Recent(MacOS) ：

source: To open any class in the editor quickly, press &shortcut:GotoClass; (Navigate | Class) and start typing the name of the class.
zh_cn: 要在编辑器中快速打开任意类，按下 &shortcut:GotoClass; (Navigate | Class) 并开始输入类名。

source: To open any class or file in the editor at the desired line, press &shortcut:GotoFile; (Navigate | File), start typing the name, and choose the one from the suggestion list.
zh_cn: 要在编辑器中打开任何类或文件并跳转到期望行，按 &shortcut:GotoFile; (Navigate | File)，开始输入名字，然后从建议列表中选择一个。

source: To open any particular file in the editor quickly, press &shortcut:GotoFile; (Navigate | File) and start typing its name.
zh_cn: 要在编辑器中快速打开任意文件，按下 &shortcut:GotoFile; (Navigate | File) 并开始输入名字。

source: To open any particular method or field in the editor quickly, press &shortcut:GotoSymbol; (Navigate | Symbol) and start typing its name.
zh_cn: 要在编辑器中打开特定的方法或字段，按 &shortcut:GotoSymbol; (Navigate | Symbol) 并输入它的名字。

source: To open the diagram, use View | Model Dependency Diagram.
zh_cn: 要打开图表，请使用 View | Model Dependency Diagram。

source: To open your browser with documentation for the element at the editor's caret, press &shortcut:ExternalJavaDoc; (View | External Documentation).
zh_cn: 要在浏览器中打开插入符号处的元素的文档，按 &shortcut:ExternalJavaDoc; (View | External Documentation)。

source: To packa&ge
zh_cn: 到包(&G)

source: To paste a specific entry from the clipboard, press &shortcut:PasteMultiple; (Edit | Paste from History) and select the entry you need.
zh_cn: 要从剪贴板粘贴特定条目，请按 &shortcut:PasteMultiple;(Edit | Paste from History)并选择您需要的条目。

source: To proper indent position
zh_cn: 正确缩进位置

source: To purchase a commercial license, please visit
zh_cn: 要购买商业许可证，请访问

source: To quickly comment or uncomment the line at the caret, or multiple selected lines, press &shortcut:CommentByLineComment; (Code | Comment with Line Comment).
zh_cn: 要快速注释或取消注释插入符号处的行，或选中的多行，按 &shortcut:CommentByLineComment; (Code | Comment with Line Comment)。

source: To quickly complete a method call of a static method located anywhere in your project, libraries or JDK, enter a prefix and press &shortcut:CodeCompletion; twice.
zh_cn: 要快速补全一个位于您项目、库或 JDK 中的方法或静态方法，输入前缀并按两次 &shortcut:CodeCompletion; 。

source: To quickly evaluate the value of any expression while debugging the program, hold Alt and click this expression to see its value and calculate it, call a method, etc.
zh_cn: 要在调试程序时快速计算任何表达式的值，请按住 Alt 键并单击此表达式以查看其值，计算表达式，调用方法等。

source: To quickly execute a Rake task press &shortcut:org.jetbrains.plugins.ruby.tasks.rake.actions.RakeTasksPopupAction; or use Tools | Run Rake task and start typing the task name.
zh_cn: 要快速执行 Rake 任务，请按 &shortcut:org.jetbrains.plugins.ruby.tasks.rake.actions.RakeTasksPopupAction; 或使用 Tools | Run Rake task 并开始输入任务名称。

source: To quickly find a file, class, symbol, or even an IDE setting, use Search Everywhere by pressing Shift twice.
zh_cn: 要快速查找文件，类，符号甚至 IDE 设置，请按 Shift 两次使用 Search Everywhere。

source: To quickly find a menu command or toolbar action, you do not need to look through the menus.
zh_cn: 要快速找到菜单命令或工具栏操作，您不需要查看菜单。

source: To quickly find an item in a tree, list, or table, start typing its caption.
zh_cn: 要快速查找树，列表或表格中的项目，请开始键入其标题。

source: To quickly find and run an inspection, press &shortcut:RunInspection; and start typing the name of the inspection or its group.
zh_cn: 要快速查找和运行检查，按 &shortcut:RunInspection; 并开始输入检查的或检查组的名字。

source: To quickly invoke a VCS-related action, use the VCS Operations popup (VCS | VCS Operations Pop-up) by pressing &shortcut:Vcs.QuickListPopupAction;.
zh_cn: 要快速调用与 VCS 相关的操作，请按 &shortcut:Vcs.QuickListPopupAction; 使用 VCS Operations 弹出窗口（VCS | VCS Operations Pop-up。(&S)

source: To quickly navigate from a Rails model to its controller, from a controller to a helper, test or a view, use &shortcut:GotoRelated; or Navigate | Related File.
zh_cn: 要从 Rails 模型快速导航到其控制器，从控制器到助手，测试或视图，请使用 &shortcut:GotoRelated; 或 Navigate | Related File。

source: To quickly navigate over the recently opened files or tool windows, press &shortcut:RecentFiles; (View | Recent Files).
zh_cn: 要快速浏览最近打开的文件或工具窗口，请按 &shortcut:RecentFiles;(View | Recent Files)。

source: To quickly prototype some code, you can create a temporary file (without giving it a name or storing it in your project).
zh_cn: 为了快速建立一些代码的原型，你可以创建一个临时文件(不需要指定名称或将其存储在项目中)。

source: To quickly run a main or test function at the caret, click the icon in the left gutter and choose whether you want to Run it, Debug it, or run with Coverage.
zh_cn: 要快速运行插入符号处的主函数或测试函数，请单击左侧阴影线中的图标，然后选择是否要 Run 它，Debug 它或运行 Coverage。

source: To quickly run a main or test function at the caret, press &shortcut:ShowIntentionActions; and select the Run intention action.
zh_cn: 要快速在插入符号处运行主函数或测试函数，请按 &shortcut:ShowIntentionActions; 并选择 Run 意向操作。

source: To quickly see all return and panic statements within a function, press &shortcut:HighlightUsagesInFile; when the caret is at the func and return keywords or the panic function.
zh_cn: 要快速查看函数中的所有返回和 panic 语句，请在插入符号位于 func 并返回关键字或 panic 函数时按 &shortcut:HighlightUsagesInFile;。

source: To quickly see the documentation for a class or method at caret, press &shortcut:QuickJavaDoc; (View | Quick Documentation).
zh_cn: 要快速查看插入符号处的类或方法的文档，按 &shortcut:QuickJavaDoc; (View | Quick Documentation)。

source: To quickly see the documentation for the class or method used at the editor's caret, press &shortcut:QuickJavaDoc; (View | Quick Documentation).
zh_cn: 要快速查看编辑器中插入符号处的类或方法的文档，按 &shortcut:QuickJavaDoc; (View | Quick Documentation)。

source: To quickly see the documentation for the symbol at caret, press &shortcut:QuickJavaDoc; (View | Quick Documentation).
zh_cn: 要快速查看插入符号处的符号的文档，按 &shortcut:QuickJavaDoc; (View | Quick Documentation)。

source: To quickly select the current file in a specific tool window or in the browser, press &shortcut:SelectIn; (Navigate | Select In) and select where you'd like to open the file.
zh_cn: 要在特定工具窗口或浏览器中快速选择当前文件，请按 &shortcut:SelectIn;(Navigate | Select In)并选择您想要的位置打开文件。

source: To quickly select the currently edited element (class, file, method or field) in any view (Project view, Structure view or other), press &shortcut:SelectIn;.
zh_cn: 要在任何视图(Project 视图, Structure 视图或其他)中选择当前编辑的元素（类，文件，方法或字段），请按 &shortcut:SelectIn;。

source: To quickly wrap a code block in useful constructs, select it in the editor, press &shortcut:SurroundWith; (Code | Surround With) and choose the desired code block, e.g. if.
zh_cn: 要使用有用的结构快速包围代码，在编辑器中选择，按 &shortcut:SurroundWith; (Code | Surround With) 然后选择所需的代码块，如 if 。

source: To repeatedly evaluate an expression in the context of the current stack frame, you can use Watches inside the Debugger tool window.
zh_cn: 要在当前堆栈帧的上下文中重复计算表达式，可以在 Debugger 工具窗口中使用 Watches。

source: To see all the available scratch files, choose Scratches view in the Project tool window.
zh_cn: 要查看所有可用的临时文件，请在 Project（项目）工具窗口中选择 Scratches 视图。

source: To see or revert recent changes to a file, folder, or even the entire project, use Local History (VCS | Local History).
zh_cn: 要查看或还原对文件，文件夹或甚至整个项目的最近更改，请使用 Local History(VCS | Local History)。

source: To see the declaration of a function, type, package, or any other symbol at the caret, press &shortcut:QuickImplementations; (View | Quick Definition).
zh_cn: 要查看插入符号处的方法，类型，包或任何其他符号的声明，请按 &shortcut:QuickImplementations;(View | Quick Definition)。

source: To see the full list of issues the IDE has detected in your code, press &shortcut:CodeInspection.OnEditor; (Code | Inspect Code), choose a particular scope (e.g. across the whole project), and select Inspection Profile.
zh_cn: 要查看 IDE 在代码中检测到的完整问题列表，请按 &shortcut:CodeInspection.OnEditor;（Code | Inspect Code），选择一个特定范围例如在整个项目中），然后选择 Inspection Profile。

source: To see the information on the available signatures, as well the parameter expected at the caret (within a function call), press &shortcut:ParameterInfo; (View | Quick Documentation).
zh_cn: 要查看可用签名的信息以及插入符号(在函数调用中)期望的参数，请按 &shortcut:ParameterInfo;(View | Quick Documentation )。

source: To see the inheritance hierarchy for a selected class, press &shortcut:TypeHierarchy; (Navigate | Type Hierarchy).
zh_cn: 要查看所选类的继承层次，按 &shortcut:TypeHierarchy; (Navigate | Type Hierarchy)。

source: To see the inheritance hierarchy for a selected function, press &shortcut:TypeHierarchy; (View | Type Hierarchy).
zh_cn: 要查看所选方法的继承层次，按 &shortcut:TypeHierarchy; (View | Type Hierarchy)。

source: To see the popup, either click the Branches widget on the right side of the status bar, or click VCS | Git (or Mercurial) | Branches.
zh_cn: 要查看弹窗，点击状态栏右侧的 Branches 小部件，或者点击 VCS | Git (或 Mercurial) | Branches 。

source: To see the structure of the current file or quickly navigate to one of its members, press &shortcut:FileStructurePopup; (Navigate | File Structure).
zh_cn: 要查看当前文件的结构或快速导航到其中一个成员，请按 &shortcut:FileStructurePopup;(Navigate | File Structure)。

source: To see your local history of changes in a file, invoke Local History | Show History from the context menu.
zh_cn: 要查看一个文件的本地修改历史记录，在上下文菜单中执行 Local History | Show History 。

source: To select multiple fragments in the "column mode", keep Control+Alt+Shift(on Windows and Linux) or Cmd+Alt+Shift(on MAC), and drag your mouse cursor:
zh_cn: 若要在 "列模式" 中选择多个片段，按住 Control+Alt+Shift(Windows 和 Linux) 或 Cmd+Alt+Shift(MAC)，然后拖动鼠标光标。

source: To select multiple words, press Alt+Shift (on Windows and Linux) or Cmd+Alt+Shift(on MAC), place the caret at each word to be selected and double-click the left mouse button.
zh_cn: 要选择多个单词，按住 Alt+Shift (Windows 和 Linux) 或 Cmd+Alt+Shift(MAC)，将插入符放到每个要选的词中并双击鼠标左键。

source: To select multiple words, press Alt+Shift, place the caret at each word to be selected and double-click the left mouse button.
zh_cn: 要选择多个单词，按住 Alt+Shift，将插入符放到每个要选的词中并双击鼠标左键。

source: To select multiple words, press Alt, place the caret at each word to be selected and double-click the left mouse button.
zh_cn: 要选择多个单词，按 Alt ，将插入符放于要选择的单词然后双击鼠标左键。

source: To select the next occurrence of the symbol at the caret, press &shortcut:SelectNextOccurrence; (Edit | Find | Add Selection for Next Occurrence).
zh_cn: 要选择插入符号中下一次出现的符号，请按 &shortcut:SelectNextOccurrence;(Edit | Find | Add Selection for Next Occurrence)。

source: To set a breakpoint with a condition, select the appropriate check-box in its settings and enter the desired expression in the Condition field.
zh_cn: 要用条件设置断点，请在其设置中选中相应的复选框，然后在Condition字段中输入所需的表达式。

source: To show separator lines between methods in the editor, open the editor settings and select the Show method separators check box in the Appearance page.
zh_cn: 要在编辑器中的方法之前显示分隔线，打开编辑器设置在 Appearance 页选择 Show method separators 复选框。

source: To skip warnings right click on the validation side bar / marker bar and choose Go to high priority problems only.
zh_cn: 要跳过警告，请右键单击验证侧栏/标记栏，然后选择仅转到高优先级问题。

source: To try it, go to commander and invoke Move to... on any class there.
zh_cn: 要尝试，在任何类上的命令中执行 Move to... 。

source: To try it, place the caret at the symbol you want to rename, and press &shortcut:RenameElement; (Refactor | Rename).
zh_cn: 要这样做，将插入符号放到你想重命名的符号处，然后按 &shortcut:RenameElement; (Refactor | Rename)。

source: To try it, place the caret at the variable you want to rename, and press &shortcut:RenameElement; (Refactor | Rename).
zh_cn: 要这样做，将插入符号放到你想重命名的变量处，然后按 &shortcut:RenameElement; (Refactor | Rename)。

source: To turn this highlighting on, enable Semantic Highlighting (Settings | Editor | Color Scheme | Language Defaults).
zh_cn: 要打开此突出显示，请启用 Semantic Highlighting(Settings | Editor | Color Scheme | Language Defaults)。

source: To uncomment a commented block press &shortcut:CommentByBlockComment; anywhere inside it.
zh_cn: 要取消块注释，在注释内部按 &shortcut:CommentByBlockComment; 。

source: To uncomment a commented block, press &shortcut:CommentByBlockComment; anywhere inside it.
zh_cn: 要取消块注释，在注释内部按 &shortcut:CommentByBlockComment; 。

source: To use multiple selection, add several cursors to your editor, and then press Shift with the left or right arrow keys.
zh_cn: 要使用多个选择，请将多个光标添加到您的编辑器中，然后按下 Shift 并使用左或右方向键。

source: To view all exit points of a method, place the caret at one of them, e.g. the return statement, and press &shortcut:HighlightUsagesInFile;:
zh_cn: 要查看一个方法的所有退出点，将插入符号放到其中一个退出点上，比如 return 语句，然后按 &shortcut:HighlightUsagesInFile;：

source: To view the available hosts, use Browse Remote Hosts command on the Tools | Deployment menu.
zh_cn: 要查看可用主机，请在 Tools | Deployment 菜单中选择 Browse Remote Hosts 命令。

source: To view which line separators style is used in the current file, look at the Status Bar:
zh_cn: 要查看当前文件中使用的换行符样式，请查看Status Bar（状态栏）：

source: To:
zh_cn: 到:

source: Today
zh_cn: 今天

source: Toggle Bookmark 0
zh_cn: 切换书签 0

source: Toggle Bookmark 1
zh_cn: 切换书签 1

source: Toggle Bookmark 2
zh_cn: 切换书签 2

source: Toggle Bookmark 3
zh_cn: 切换书签 3

source: Toggle Bookmark 4
zh_cn: 切换书签 4

source: Toggle Bookmark 5
zh_cn: 切换书签 5

source: Toggle Bookmark 6
zh_cn: 切换书签 6

source: Toggle Bookmark 7
zh_cn: 切换书签 7

source: Toggle Bookmark 8
zh_cn: 切换书签 8

source: Toggle Bookmark 9
zh_cn: 切换书签 9

source: Toggle Bookmark with Mnemonic
zh_cn: 使用助记符切换书签

source: Toggle Case
zh_cn: 切换大小写

source: Toggle Diff Highlight Mode
zh_cn: 切换差异高亮模式

source: Toggle Diff Ignore Whitespace
zh_cn: 切换差异忽略空格

source: Toggle Distraction Free mode
zh_cn: 切换免打扰模式

source: Toggle Full Screen mode
zh_cn: 切换全屏模式

source: Toggle Insert/Overwrite
zh_cn: 切换插入/覆盖

source: Toggle Popup Hints for Current File
zh_cn: 切换当前文件的弹出提示

source: Toggle Presentation mode
zh_cn: 切换演示模式

source: Toggle Read-Only Attribute
zh_cn: 切换只读属性

source: Toggle Sticky Selection
zh_cn: 切换粘性选择

source: Toggle Temporary Line Breakpoint
zh_cn: 切换临时行断点

source: Toggle _Bookmark
zh_cn: 切换书签(_B)

source: Toggle _Breakpoint Enabled
zh_cn: 切换断点可用性(_B)

source: Toggle _Field Watchpoint
zh_cn: 切换字段断点(_F)

source: Toggle _Line Breakpoint
zh_cn: 切换行断点(_L)

source: Toggle _Method Breakpoint
zh_cn: 切换方法断点(_M)

source: Toggle between tabbed/combo presentation of contents
zh_cn: 在标签式/组合式之间切换显示内容

source: Toggle between the vertical and side-by-side placement of the tool windows by Ctrl+Click/Cmd+Click on the splitter:
zh_cn: 在分割线上使用 Ctrl+单击 / Cmd+单击，可以在工具窗口的垂直放置和并排放置之间切换：

source: Toggle between the vertical and side-by-side placement of the tool windows by Ctrl+click (Windows/*nix) or Cmd+click (Mac) on the splitter:
zh_cn: 在分割线上使用 Ctrl+click (Windows/*nix) 或 Cmd+click (Mac) ，可以在工具窗口的垂直放置和并排放置之间切换：

source: Toggle between the vertical and side-by-side placement of the tool windows by Ctrl+click on the splitter:
zh_cn: 在工具窗口的垂直位置和并排位置之间切换，方法是按住 Ctrl 并单击分隔线：

source: Toggle between the vertical and side-by-side placement of the tool windows by Ctrl+click/Cmd+Click on the splitter:
zh_cn: 在分割线上使用 Ctrl+单击 / Cmd+单击，可以在工具窗口的垂直放置和并排放置之间切换：

source: Toggle bookmark at the current location
zh_cn: 在当前位置切换书签

source: Toggle column selection mode in current editor
zh_cn: 在当前编辑窗口切换列选择模式

source: Toggle display gutter icons in current editor
zh_cn: 在当前编辑器中切换显示 Gutter 图标

source: Toggle display import popups in current file
zh_cn: 在当前文件中切换显示导入弹窗

source: Toggle display indent guides in current editor
zh_cn: 在当前编辑器中切换显示缩进指南

source: Toggle display line numbers in current editor
zh_cn: 当前编辑窗口中切换行号显示

source: Toggle display the breadcrumbs bar in current editor
zh_cn: 在当前编辑器中切换显示面包屑导航

source: Toggle display whitespaces in current editor
zh_cn: 在当前编辑器中切换显示空格

source: Toggle field watchpoint for the field at caret
zh_cn: 为插入符号处的字段切换观察点

source: Toggle grid lines over image
zh_cn: 切换图像上的网格线

source: Toggle line breakpoint at caret
zh_cn: 在插入符号入切换线断点

source: Toggle method breakpoint for the method at caret
zh_cn: 为插入符号处的方法切换方法断点

source: Toggle parameter name hints
zh_cn: 切换参数名称提示

source: Toggle read-only attribute of current file
zh_cn: 切换当前文件的只读属性

source: Toggle recursive browsing
zh_cn: 切换递归浏览

source: Toggle show whitespace in the editor
zh_cn: 在编辑器中切换显示空白

source: Toggle temporary line breakpoint at caret
zh_cn: 在插入符处切换临时行断点

source: Toggle the breadcrumbs bar settings
zh_cn: 切换面包屑导航栏设置

source: Toggle transparency chessboard under image
zh_cn: 在图像下切换透明度棋盘

source: Toggle tree/text mode
zh_cn: 切换树/文本模式

source: Toggle using soft wraps in current editor
zh_cn: 当前编辑窗口中切换自动换行

source: Toggle using soft wraps in preview editors
zh_cn: 切换在编辑器预览中使用自动换行

source: Toggles horizontal/vertical toolbar orientation
zh_cn: 切换水平/垂直工具栏方向

source: Toggles if value tooltip is shown automatically on mouse over
zh_cn: 切换当鼠标悬停时，是否自动显示值提示

source: Toggles if value tooltip is shown automatically on selection change in editor
zh_cn: 切换在编辑器中的选择更改时，是否自动显示值提示

source: Too Many {0}
zh_cn: 太多的 {0}

source: Too many IDE fatal errors.
zh_cn: 太多的 IDE 致命错误。

source: Too many characters in character literal
zh_cn: 字符文字中的字符太多

source: Tool Windows Quick Access
zh_cn: 工具窗口快速访问

source: Tool settings
zh_cn: 工具设置

source: Tool windows split mode on/off
zh_cn: 工具窗口开启/关闭拆分模式

source: Toolbar Find Actions
zh_cn: 工具栏查找操作

source: Toolbar Make Actions
zh_cn: 工具栏创建操作

source: Toolbar New Element Group
zh_cn: 工具栏新元素组

source: Toolbar Run Actions
zh_cn: 工具栏运行操作

source: Tools
zh_cn: 工具

source: Tools Basic Group
zh_cn: 基本工具组

source: Tools support
zh_cn: 工具支持

source: Tools:
zh_cn: 工具:

source: Top level element is not completed
zh_cn: 顶级元素未完成

source: Total:
zh_cn: 总计:

source: Tr&y Again
zh_cn: 重试(&Y)

source: Track Running Test
zh_cn: 监听运行测试

source: Track changed blocks in text files separately
zh_cn: 分别跟踪文本文件中更改的块

source: Trailing
zh_cn: 末尾的

source: Trailing comma in annotation array initializer may cause compilation error in some Javac versions (e.g. JDK 5 and JDK 6).
zh_cn: 注解数组初始化器中的后跟逗号可能会导致某些 Javac 版本(例如 JDK 5和 JDK 6)中的编译错误。

source: Transform {0} into final one element array
zh_cn: 将 {0} 转换成 final 单元素数组

source: Transparency
zh_cn: 透明

source: Transparency Chessboard
zh_cn: 透明度棋盘

source: Transparent native-to-ascii conversion
zh_cn: 透明的 native-to-ascii 转换

source: Transport:
zh_cn: 传输:

source: Tree Layout
zh_cn: 树布局

source: Tree View
zh_cn: 树视图

source: Triggering error
zh_cn: 触发错误

source: Trim space
zh_cn: 清除空格

source: Tritanopia (blue)
zh_cn: 蓝色盲(蓝)

source: Troubleshooting Guide
zh_cn: 故障排除指南

source: Try Live Templates
zh_cn: 尝试代码模板

source: Try again
zh_cn: 重试

source: Try out the features described in the tips while this dialog stays open on the screen.
zh_cn: 此对话框在屏幕上保持打开状态时，请尝试使用提示中描述的功能。

source: Try to generify ''{0}''
zh_cn: 尝试生成 ''{0}''

source: Tune the &productName; tool windows layout to make better use of your screen.
zh_cn: 调整 &productName; 的工具窗口布局，以更好地利用你的屏幕。

source: Turn the method into its own object so that all the parameters become fields on that object
zh_cn: 将该方法转换为自己的对象，以便所有参数都成为该对象上的字段

source: Turn the selected code fragment into a method
zh_cn: 把选中代码片段转换为一个方法

source: Turn the selected code fragment into included file
zh_cn: 将选中代码片段转换为包含的文件

source: Turn the selected expression into method parameter
zh_cn: 将选中表达式转换为方法参数

source: Turn the selected variable into a method
zh_cn: 将选中变量转换为方法

source: Two different type constraints
zh_cn: 两种不同的类型约束

source: Two modules in a project cannot share the same content root.
zh_cn: 项目中的两个模块不能共享相同的内容根。

source: Type
zh_cn: 类型

source: Type ''{0}'' for parameter ''{1}'' cannot be resolved.
zh_cn: 无法解析参数 ''{1}'' 的类型 ''{0}''。

source: Type Arguments
zh_cn: 类型参数

source: Type Migration...
zh_cn: 类型迁移...

source: Type Parameters
zh_cn: 类型参数

source: Type _Hierarchy
zh_cn: 类型层次结构(_H)

source: Type an expression and press 'Enter'
zh_cn: 键入一个表达式然后按 'Enter'

source: Type annotations
zh_cn: 类注解

source: Type argument cannot be of primitive type
zh_cn: 类型参数不能是原始类型

source: Type arguments given on a raw method
zh_cn: 类型参数给了原始方法

source: Type arguments given on a raw type
zh_cn: 类型参数给了原始类型

source: Type cast parentheses
zh_cn: 类型转换括号

source: Type expected
zh_cn: 期望类型

source: Type is unknown for ''{0}''
zh_cn: ''{0}'' 的类型未知

source: Type mismatch
zh_cn: 类型不匹配

source: Type of selected expression cannot be determined.
zh_cn: 所选表达式的类型无法确定。

source: Type parameter
zh_cn: 类型参数

source: Type parameter ''{0}'' cannot be instantiated directly
zh_cn: 类型参数 ''{0}'' 不能直接实例化
